# -*- coding: utf-8 -*-
# key：控制台输入的分类，value：跳转访问的页面cid
good_type_dicts = {
    # 输出格式
    'a': ['csv', '.csv'],
    'b': ['excel', '.xlsx'],
    'c': ['txt', '.txt'],
    'd': ['json', '.json'],
    'e': ['xml', '.xml'],
    'f': ['word', '.word'],
    'g': ['pdf', '.pdf'],
    'h': ['mysql', 'mysql'],
    'i': ['mongodb', 'mongodb'],
    'j': ['oracle', '.oracle'],

    # 1x开头的为"生活电器办公文娱"大类
    '10': ['430385', '生活电器、办公文娱'],  # 大类，后面均为该大类下的分类
    '11': ['430386', '厨房电器'],
    '12': ['430395', '生活电器'],
    '13': ['430413', '保健器材'],
    '14': ['430401', '个人健康'],
    '15': ['430405', '办公文仪'],
    '16': ['430418', '运动用品'],
    '17': ['430423', '学生用品'],
    # 11x开头的为"厨房电器"大类下的小类
    '110': ['430386', '厨房电器'],  # 大类，后面均为该大类下的小分类
    '111': ['1640000', '其他'],
    '112': ['430387', '微波炉'],
    '113': ['430388', '电饭锅/煲'],
    '114': ['430391', '豆浆机/榨汁机'],
    '115': ['430392', '电磁炉 '],
    '116': ['430393', '电炖锅/压力锅'],
    '117': ['430394', '净水器'],
    '118': ['470000', '电水壶'],
    # 12x开头的为"生活电器"大类下的小类
    '120': ['430395', '生活电器'],  # 大类，后面均为该大类下的小分类
    '121': ['1780003', '智能设备'],
    '122': ['430396', '电风扇/电暖器'],
    '123': ['430397', '吸尘器'],
    '124': ['430398', '电熨斗'],
    '125': ['430399', '加湿器'],
    '126': ['430400', '空气净化器'],
    '127': ['560000', '电器附件'],
    '128': ['670023', '手机数码'],
    # 14x开头的为"个人健康"大类下的小类
    '140': ['430401', '个人健康'],  # 大类，后面均为该大类下的小分类
    '141': ['1770000', '美容器/脱毛器'],
    '142': ['1960001', '电动牙刷'],
    '143': ['430402', '按摩器'],
    '144': ['430403', '足浴盆'],
    '145': ['430404', '电吹风'],
    '146': ['660017', '电动剃须刀'],
    # 13x开头的为"保健器材"、运动用品、学生用品等大类下的小类
    '130': ['430413', '保健器材'],  # 大类，后面均为该大类下的小分类
    '131': ['430415', '保健器械'],
    '132': ['430418', '运动用品'],  # 大类，后面均为该大类下的小分类
    '133': ['430420', '球类'],
    '134': ['430423', '学生用品'],  # 大类，后面均为该大类下的小分类
    '135': ['430424', '书包'],
    '136': ['430428', '卷笔刀/削笔器'],
    '137': ['430430', '文笔盒/笔袋'],
    '138': ['430432', '其他用品'],
    '139': ['730000', '笔类'],
    # 15x开头的为"办公文仪"大类下的小类
    '150': ['430405', '办公文仪'],
    '151': ['1780002', '电脑'],
    '152': ['430407', '本册便签'],
    '153': ['430408', '笔类'],
    '154': ['430409', '白板/写字板'],
    '155': ['430411', '桌面整理'],
    '156': ['430412', '纸品'],
    '157': ['710058', '其他办公用品'],

}

if __name__ == '__main__':
    print good_type_dicts.get('102')[1]
